icoFoamRectangle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       19380;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       19470;
    }
    box
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       19560;
    }
    top
    {
        type            patch;
        nFaces          110;
        startFace       19600;
    }
    bottom
    {
        type            patch;
        nFaces          110;
        startFace       19710;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9800;
        startFace       19820;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9800;
        startFace       29620;
    }
)

// ************************************************************************* //
